exp_3_node/logs5/lr_11_app2_50rps_wrk.log
Running 30s test @ http://10.106.228.182/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 74.877ms, rate sampling interval: 217ms
  Thread calibration: mean lat.: 80.642ms, rate sampling interval: 224ms
  Thread calibration: mean lat.: 92.461ms, rate sampling interval: 301ms
  Thread calibration: mean lat.: 73.092ms, rate sampling interval: 227ms
  Thread calibration: mean lat.: 80.485ms, rate sampling interval: 212ms

-----------------------------------------------------------------------
Test Results @ http://10.106.228.182/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    85.13ms   43.89ms 212.10ms   83.47%
    Req/Sec     9.51      2.84    14.00     84.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   72.83ms
 75.000%  105.92ms
 90.000%  134.40ms
 99.000%  212.10ms
 99.900%  306.69ms
 99.990%  320.26ms
 99.999%  320.26ms
100.000%  320.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.511     0.000000            1         1.00
      41.823     0.100000          101         1.11
      49.055     0.200000          201         1.25
      51.007     0.300000          303         1.43
      58.111     0.400000          402         1.67
      72.831     0.500000          502         2.00
      93.695     0.550000          553         2.22
      97.343     0.600000          603         2.50
      99.263     0.650000          653         2.86
     104.895     0.700000          703         3.33
     105.919     0.750000          753         4.00
     106.751     0.775000          781         4.44
     107.839     0.800000          804         5.00
     111.743     0.825000          829         5.71
     114.943     0.850000          854         6.67
     120.639     0.875000          879         8.00
     122.815     0.887500          892         8.89
     134.399     0.900000          904        10.00
     142.719     0.912500          917        11.43
     154.111     0.925000          929        13.33
     187.007     0.937500          942        16.00
     188.287     0.943750          948        17.78
     189.055     0.950000          954        20.00
     189.695     0.956250          962        22.86
     191.999     0.962500          967        26.67
     193.919     0.968750          973        32.00
     194.559     0.971875          976        35.56
     195.199     0.975000          979        40.00
     197.503     0.978125          983        45.71
     201.471     0.981250          986        53.33
     206.591     0.984375          989        64.00
     210.687     0.985938          990        71.11
     211.455     0.987500          992        80.00
     212.095     0.989062          994        91.43
     212.351     0.990625          995       106.67
     213.759     0.992188          997       128.00
     213.759     0.992969          997       142.22
     220.671     0.993750          998       160.00
     243.327     0.994531          999       182.86
     247.167     0.995313         1000       213.33
     264.703     0.996094         1001       256.00
     264.703     0.996484         1001       284.44
     264.703     0.996875         1001       320.00
     294.655     0.997266         1002       365.71
     294.655     0.997656         1002       426.67
     306.687     0.998047         1003       512.00
     306.687     0.998242         1003       568.89
     306.687     0.998437         1003       640.00
     306.687     0.998633         1003       731.43
     306.687     0.998828         1003       853.33
     320.255     0.999023         1004      1024.00
     320.255     1.000000         1004          inf
#[Mean    =       85.130, StdDeviation   =       43.886]
#[Max     =      320.000, Total count    =         1004]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1495 requests in 30.00s, 455.82KB read
Requests/sec:     49.83  
Transfer/sec:     15.19KB