exp_3_node/logs5/lr_13_app1_75rps_wrk.log
Running 30s test @ http://10.110.180.220/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 2181.603ms, rate sampling interval: 7917ms
  Thread calibration: mean lat.: 1899.088ms, rate sampling interval: 6815ms
  Thread calibration: mean lat.: 1824.171ms, rate sampling interval: 6365ms
  Thread calibration: mean lat.: 2088.008ms, rate sampling interval: 7352ms
  Thread calibration: mean lat.: 1524.565ms, rate sampling interval: 5730ms

-----------------------------------------------------------------------
Test Results @ http://10.110.180.220/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.61s     2.18s   11.50s    58.15%
    Req/Sec     9.00      0.41    10.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.62s 
 75.000%    9.55s 
 90.000%   10.57s 
 99.000%   11.50s 
 99.900%   11.76s 
 99.990%   11.80s 
 99.999%   11.80s 
100.000%   11.80s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3219.455     0.000000            1         1.00
    4694.015     0.100000           94         1.11
    5414.911     0.200000          188         1.25
    6086.655     0.300000          282         1.43
    6844.415     0.400000          376         1.67
    7622.655     0.500000          470         2.00
    7942.143     0.550000          517         2.22
    8339.455     0.600000          564         2.50
    8749.055     0.650000          611         2.86
    9125.887     0.700000          658         3.33
    9560.063     0.750000          706         4.00
    9732.095     0.775000          729         4.44
    9904.127     0.800000          753         5.00
   10108.927     0.825000          775         5.71
   10239.999     0.850000          799         6.67
   10420.223     0.875000          824         8.00
   10518.527     0.887500          834         8.89
   10567.679     0.900000          847        10.00
   10657.791     0.912500          857        11.43
   10756.095     0.925000          871        13.33
   10821.631     0.937500          882        16.00
   10870.783     0.943750          888        17.78
   10919.935     0.950000          893        20.00
   10993.663     0.956250          898        22.86
   11051.007     0.962500          904        26.67
   11149.311     0.968750          911        32.00
   11165.695     0.971875          913        35.56
   11182.079     0.975000          916        40.00
   11214.847     0.978125          919        45.71
   11263.999     0.981250          922        53.33
   11313.151     0.984375          925        64.00
   11419.647     0.985938          926        71.11
   11444.223     0.987500          929        80.00
   11444.223     0.989062          929        91.43
   11534.335     0.990625          931       106.67
   11558.911     0.992188          932       128.00
   11575.295     0.992969          933       142.22
   11616.255     0.993750          934       160.00
   11616.255     0.994531          934       182.86
   11657.215     0.995313          935       213.33
   11689.983     0.996094          936       256.00
   11689.983     0.996484          936       284.44
   11714.559     0.996875          937       320.00
   11714.559     0.997266          937       365.71
   11714.559     0.997656          937       426.67
   11755.519     0.998047          938       512.00
   11755.519     0.998242          938       568.89
   11755.519     0.998437          938       640.00
   11755.519     0.998633          938       731.43
   11755.519     0.998828          938       853.33
   11796.479     0.999023          939      1024.00
   11796.479     1.000000          939          inf
#[Mean    =     7612.843, StdDeviation   =     2179.447]
#[Max     =    11788.288, Total count    =          939]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1402 requests in 30.00s, 427.82KB read
Requests/sec:     46.73  
Transfer/sec:     14.26KB