exp_3_node/logs5/lr_16_app1_75rps_wrk.log
Running 30s test @ http://10.100.160.80/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 872.061ms, rate sampling interval: 2863ms
  Thread calibration: mean lat.: 912.612ms, rate sampling interval: 2818ms
  Thread calibration: mean lat.: 643.022ms, rate sampling interval: 1887ms
  Thread calibration: mean lat.: 778.748ms, rate sampling interval: 2682ms
  Thread calibration: mean lat.: 583.785ms, rate sampling interval: 1777ms

-----------------------------------------------------------------------
Test Results @ http://10.100.160.80/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.74s   951.25ms   4.76s    62.73%
    Req/Sec    12.15      1.16    14.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.65s 
 75.000%    3.44s 
 90.000%    4.07s 
 99.000%    4.76s 
 99.900%    4.89s 
 99.990%    4.93s 
 99.999%    4.93s 
100.000%    4.93s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     931.839     0.000000            1         1.00
    1539.071     0.100000          127         1.11
    1859.583     0.200000          254         1.25
    2117.631     0.300000          384         1.43
    2355.199     0.400000          508         1.67
    2650.111     0.500000          635         2.00
    2822.143     0.550000          699         2.22
    2977.791     0.600000          763         2.50
    3162.111     0.650000          825         2.86
    3323.903     0.700000          889         3.33
    3438.591     0.750000          953         4.00
    3543.039     0.775000          986         4.44
    3764.223     0.800000         1016         5.00
    3817.471     0.825000         1047         5.71
    3874.815     0.850000         1080         6.67
    3962.879     0.875000         1112         8.00
    4018.175     0.887500         1128         8.89
    4075.519     0.900000         1143        10.00
    4151.295     0.912500         1159        11.43
    4186.111     0.925000         1174        13.33
    4259.839     0.937500         1191        16.00
    4292.607     0.943750         1198        17.78
    4329.471     0.950000         1206        20.00
    4358.143     0.956250         1214        22.86
    4390.911     0.962500         1222        26.67
    4521.983     0.968750         1230        32.00
    4550.655     0.971875         1234        35.56
    4562.943     0.975000         1238        40.00
    4583.423     0.978125         1242        45.71
    4661.247     0.981250         1246        53.33
    4739.071     0.984375         1250        64.00
    4743.167     0.985938         1252        71.11
    4747.263     0.987500         1255        80.00
    4763.647     0.989062         1257        91.43
    4767.743     0.990625         1259       106.67
    4771.839     0.992188         1260       128.00
    4792.319     0.992969         1261       142.22
    4820.991     0.993750         1262       160.00
    4825.087     0.994531         1263       182.86
    4849.663     0.995313         1265       213.33
    4849.663     0.996094         1265       256.00
    4849.663     0.996484         1265       284.44
    4870.143     0.996875         1266       320.00
    4870.143     0.997266         1266       365.71
    4874.239     0.997656         1267       426.67
    4874.239     0.998047         1267       512.00
    4874.239     0.998242         1267       568.89
    4894.719     0.998437         1268       640.00
    4894.719     0.998633         1268       731.43
    4894.719     0.998828         1268       853.33
    4894.719     0.999023         1268      1024.00
    4894.719     0.999121         1268      1137.78
    4931.583     0.999219         1269      1280.00
    4931.583     1.000000         1269          inf
#[Mean    =     2739.508, StdDeviation   =      951.252]
#[Max     =     4927.488, Total count    =         1269]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1919 requests in 30.00s, 584.99KB read
Requests/sec:     63.96  
Transfer/sec:     19.50KB